Dlubal.TimberPro.TaperGrainParallelTo
Direction of grain

Dlubal.TimberPro.TaperGrainParallelTo.GrainUnknown
Unknown direction

Dlubal.TimberPro.TaperGrainParallelTo.GrainParallelToEdgeInPositiveZDirection
Direction parallel to the edge with positive z

Dlubal.TimberPro.TaperGrainParallelTo.GrainParallelToEdgeInNegativeZDirection
Direction parallel to the edge with negative z

Dlubal.TimberPro.TaperGrainParallelTo.GrainRawLog
Direction of grain as in raw log

Dlubal.TimberPro.TaperGrainParallelTo.GrainParallelToCenterLine
Direction parallel to center line

Dlubal.TimberPro.TaperGrainParallelTo.GrainCutAround
Direction of grain as in cut around timber. Not supported yet.